import React from "react";

function Message()
{
 const m=[{
    id:1,
    name:"Людмила:",
    m:"Ця аніме-фігурка просто чарівна! Деталі на висоті, кольори яскраві і насичені. Вона чудово вписалася в мою колекцію, і я дуже задоволена цією покупкою. Рекомендую для всіх фанатів аніме!",
    },
 {
    id:2,
    name:"Олег:",
    m:"Я давно шукав фігурку з моєї улюбленої аніме серії, і цей товар виявився ідеальним вибором. Якість виготовлення вражає, а деталі неймовірно точні. Дякую, що надали такий чудовий продукт!",
     },
     {
        id:3,
        name:"Анна:",
        m:"Нещодавно отримала цю аніме-фігурку в подарунок від друзів, і я захоплена! Вона дуже миленька і докладно відтворена, а її пофарбування бездоганне. Тепер це моя улюблена прикраса на полиці.",
         },
         {
            id:4,
            name:"Максим:",
            m:"Цей товар - прекрасний спосіб виразити свою пристрасть до аніме. Він дуже деталізований, і відчуття, які він викликає, неймовірні. Я вже замовив ще одну фігурку з цієї серії!",
             },
             {
                id:5,
                name:"Юлія:",
                m:"Аніме-товар - це мій слабкий бік, і ця фігурка не розчарувала. Вона виготовлена з великою увагою до деталей, і її реалістичний вигляд просто зачаровує. Я впевнена, що ця покупка стане яскравою прикрасою моєї кімнати.",
                 },
]
    return(
        <>
        <div>
        {m.map((message) => (
            <div key={message.id}>
            <h3>{message.name}</h3>
            <p>{message.m}</p>
            </div>
        ))}
        </div>
        </>
    )
}
export default Message;